[
    {
        "content": "<p>I'm seriously considering building a \"creator\" PC instead this time. Has anyone gone the Windows route from macOS and liked it?</p>\n<p>The main concern I had was being able to use Adobe Creative Cloud on both platforms at the same time and it's totally possible. You can install on macOS and Windows (2 machines) and that's totally fine with the license.</p>",
        "id": 494249343,
        "sender_full_name": "Adam Stacoviak",
        "timestamp": 1737068686
    },
    {
        "content": "<p>I personally like a good workstation for creating. I'm not a fan of Windows but I really like its driver compatibility with everything. I like workstations because they have PCI slots for graphics cards, capture cards, etc. macOS machines don't have PCI slots unless you get a Mac Pro. Apple pretty much forces you to use USB devices but those often have a limit of the number of specific types of devices you can use on a single bus. For example, one capture card per bus. macOS seems to have decent driver compatibility but not like Windows.</p>\n<p>I'm running Linux right now and it's a struggle to find good hardware that's supported. All the PCI hardware is pretty much off the table. There are days where I miss having Window for ease of use but I was forced into a VM to create the actual content.</p>\n<p>If you need PCI devices or you use software/hardware that's not supported on macOS then Windows is a fine choice. Just de bloat it with all the preinstalled crap. If you don't need PCI devices and the software you need runs well on macOS then get a nice macOS workstation like the iMac or mini. I've never been a fan of using a laptop as a workstation for similar reasons listed about. Lack of PCI slots, needing to worry about battery cycles. Lack of general power or cooling compared to a workstation.</p>",
        "id": 494283075,
        "sender_full_name": "Matthew Sanabria",
        "timestamp": 1737089551
    },
    {
        "content": "<p>I keep coming back to the sad part of a creator PC is having to run Windows.</p>",
        "id": 494904711,
        "sender_full_name": "Adam Stacoviak",
        "timestamp": 1737404017
    },
    {
        "content": "<p>In about 2018 went from using a 2013 MacBook Pro to a Windows desktop, and a few years later to a high spec Windows laptop. It was fine, and WSL made it pretty decent for programming. I switched back to MacOS about 6 months ago with a M3 MacBook Air and now I avoid even turning on the Windows Laptop: why do the fans need to run so loud when I’m not even doing anything!?! Windows was fine and served me well for many years, but Apple Silicon Macs are just a joy to use.</p>",
        "id": 494916964,
        "sender_full_name": "James Thurley",
        "timestamp": 1737408783
    },
    {
        "content": "<p>I have some big 4k videos I need to edit and was planning to give Arch the old \"college try\". I recently discovered that Blender has a bunch of video editing features, so I'm super curious if the combo of Resolve + Blender on Linux is good enough. I always hated the Premiere &lt;-&gt; After Effects workflow, so the idea of a proper video timeline built into Blender sounds like it could be pretty nice. Right now I'm just mentally blocked on whether I should attempt to dual boot Windows or just blow it away and force myself to live with Macbook + Arch desktop for a while.</p>",
        "id": 495990577,
        "sender_full_name": "Tommy Byrd",
        "timestamp": 1737916614
    },
    {
        "content": "<p>Omakub has my attention right now. Divinci Resolve and Blender work on Linux. There’s also Friction to consider too.</p>",
        "id": 495998946,
        "sender_full_name": "Adam Stacoviak",
        "timestamp": 1737923442
    }
]