[
    {
        "content": "<p>So today I am in my laptop and go to work on some files in my dropbox folder and notice that my changes from desktop are not there. That's weird. I go to my desktop and dropbox is running, I open up VS code and see the files are as I left them but they are not showing up on my laptop.</p>\n<p>I start digging into it and apparently Dropbox moved the dropbox folder from my external drive to ~/Library/cloudstorage/Dropbox.  I have no idea when it did this and if it told me I must have clicked through it but I have no memory of this at all. Dropbox claims you are not allowed to change this location either because of the OS version (WTF?). </p>\n<p>I look around and apparently there is a procedure for putting your dropbox folder on external drive but you have to use the beta software . Furthermore your drive has to be encrypted (WTF?) and APFS. Once that's done  you have to log out of all your accounts and log back in again and then you can point your dropbox folder to the external drive.</p>\n<p>Honestly what the actual fsck  is this all about? Why did apple decide nobody is allowed to store their dropbox folder elsewhere? Why did Dropbox decide to obey them? Why is there such an elaborate routine to use it on an external disk? Why does the external disk need to be encrypted? </p>\n<p>More importantly why wasn't this made more obvious to me? Here I have been using it for months thinking my files are being backed up and none of them actually are. </p>\n<p>Dropbox you really suck for doing this to me.</p>",
        "id": 540722042,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1758524828
    },
    {
        "content": "<p>So I bought a new m4 macbook air. I bought it second hand but it's new. It's all tricked out with 32 gigs of RAM and and 512 gigs of storage. My old m1 macbook air has a couple of scratches and a ding on it because I have butterfingers sometimes so I decided to get a cover for this one. I went to Temu and found one on sale for $7 dollars NZD which is basically free so I bought it along with a few other items. Temu gives you free shipping if you have a minimum order amount.</p>\n<p>The point is this thing is great!. It has a nice color, it was a subtle texture which makes it grippy and easy to handle, it's not heavy, the feet on it are grippy on the desk and makes the macbook feel much less fragile.  </p>\n<p>If you don't have a cover for your macbook air I would recommend you get one.</p>\n<p>Now all I need to do figure out how to keep the crumbs off the keyboard.</p>",
        "id": 543026062,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1759523930
    },
    {
        "content": "<p>If anybody is thinking about upgrading to IOS 26 my advice is to hold off. Since the upgrade I have had numerous problems both the iphone and the apple watch. The battery of the apple watch is just horrible now. It won't even last until the evening anymore and I have no idea why. I have turned off all kinds of stuff and removed most apps from it but no help.</p>\n<p>On the phone itself I have had weird problems. The find my is no longer reporting when I leave my stuff behind and some games start stuttering after playing them a while.</p>",
        "id": 543664170,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1759902485
    }
]