[
    {
        "content": "<p><a href=\"#narrow/channel/457248-applenerds/topic/IOS26/near/543664170\">A message</a> was moved here from <a class=\"stream-topic\" data-stream-id=\"457248\" href=\"/#narrow/channel/457248-applenerds/topic/DropBox.20Rant/with/543026062\">#applenerds &gt; DropBox Rant</a> by <span class=\"user-mention silent\" data-user-id=\"755905\">Tim Uckun</span>.</p>",
        "id": 543834896,
        "sender_full_name": "Notification Bot",
        "timestamp": 1759957628
    },
    {
        "content": "<p>I’m on an iPhone 17 and iOS 26.0.1 and haven’t had any issues fwiw. But I don’t play any games except DuoLingo and NYT</p>",
        "id": 543849558,
        "sender_full_name": "Lars Ellingsen",
        "timestamp": 1759967434
    },
    {
        "content": "<p>I haven’t had any problems on iOS 26, but I don’t have an Apple Watch. My wife has experienced decreased battery life and she has a watch. So you might be on to something, Tim.</p>",
        "id": 543852236,
        "sender_full_name": "Jerod Santo",
        "timestamp": 1759969528
    },
    {
        "content": "<p>I play mostly chess and polytopia. Polytopia is having serious problems with IOS26. If I ever put the phone down so that the screen locks during a game when I come back the scrolling becomes a stuttery mess and I have to kill the game and restart it.</p>\n<p>Lichess stops any audio playing when you launch it which is weird because it never used to do that before.</p>",
        "id": 543863912,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1759979959
    },
    {
        "content": "<p>I don’t have any noticeable battery issues (with a watch) but what’s really bugging me is you seemingly can’t dismiss the keyboard anymore without hitting the submit button. And tapping the top of the screen no longer takes you to the top of the page</p>",
        "id": 543884203,
        "sender_full_name": "Dustin",
        "timestamp": 1759993515
    },
    {
        "content": "<p>Just to be clear. My phone battery usage isn't different, it's the watch that can't make it till sundown.</p>",
        "id": 543890816,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1759995860
    },
    {
        "content": "<p>I am about to go on a long trip, does anybody have any recommendations for an offline game for IOS.  Ideally turn based so I can put it down and pick it back up again. Not too taxing intellectually so I can just play at idle times, game play not too long, and ideally free or cheap.</p>\n<p>Right now I am playing polytopia which fits the bill but they keep messing with the game and  for me at least every update has made the game less unjoyable so I am looking for an alternative.</p>\n<p>I already have lichess which has offline gaming and uniwar which has a very limited offline mode.  </p>\n<p>Thanks.</p>",
        "id": 548337073,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1762029616
    }
]