[
    {
        "content": "<p>It might be time for an upgrade... <a href=\"https://www.apple.com/macbook-pro/\">https://www.apple.com/macbook-pro/</a></p>\n<p>HOWEVER I am also intrigued by what Framework is up to... <a href=\"https://frame.work\">https://frame.work</a></p>",
        "id": 479875075,
        "sender_full_name": "Jerod Santo",
        "timestamp": 1730380587
    },
    {
        "content": "<p>I have been very happy with my m1 macbook air but yea I think with the m4's I need to upgrade. I should also upgrade my iphone 13 at this point too I guess. Time to open up that wallet.</p>\n<p>Having said that I think the resale value on both my laptop and phone will be decent so that's a bonus.</p>\n<p>Note: When I visit the <a href=\"http://frame.work\">frame.work</a> web site it says not available in your country.  I am a macbook air fanboi for decades now so not important to me but I thought I would let you all know.</p>",
        "id": 480115113,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1730493464
    },
    {
        "content": "<p>I’m still in love with M1 but I recently switched to 14” at work and it’s gorgeous. The only thing that tempts me is to downsize.</p>",
        "id": 480296296,
        "sender_full_name": "Dustin",
        "timestamp": 1730629432
    },
    {
        "content": "<p>I bought my wife an M1 iMac a while back and most of the time it sits there doing nothing. All she does is basically use safari to do web stuff and youtube and stuff.</p>\n<p>I want to make better use of this machine. It doesn't have a lot of disk space or RAM (minimal configuration). </p>\n<p>Any suggestions?</p>\n<p>Maybe this is better posted on the homelab channel.</p>",
        "id": 480791127,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1730836878
    },
    {
        "content": "<p>I was watching one of those m4 mac mini teardown videos and one of the guys was running it upside down after he upgraded the hard drive. I was thinking that this is brilliant. The power button is now on top, the wifi antennas are on top and the fans are on top. </p>\n<p>It seems like this should be the preferred way to use this computer no?</p>",
        "id": 481493879,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1731185649
    },
    {
        "content": "<p>Putting the power button on the bottom is so strange.</p>",
        "id": 481770028,
        "sender_full_name": "Adam Stacoviak",
        "timestamp": 1731344942
    },
    {
        "content": "<p>To be fair I very rarely use the power button on any of my macs.</p>",
        "id": 481810558,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1731359833
    },
    {
        "content": "<p>I am thinking about getting a m4 mac mini. I am currently using an intel macbook as my \"desktop\" with a couple of monitors attached. I also have a M1 Macbook air for using in the living room sitting at the couch, streaming etc as well as when I am traveling. </p>\n<p>The question is should I buy the mac mini or a macbook pro for my desktop. If I bought the mac mini I would most likely also a buy a m4 macbook air when it comes out (maybe, probably).  If I bought the macbook pro I would also want to buy a docking station of sorts to handle my setup because I am unhappy with the way things are set up now. Also I would be carrying the laptop back and forth between upstairs and downstairs every day and plugging an unplugging every day.</p>\n<p>What do you guys think? I know it's going to cost more to buy two machines but probably not that much more and I'll get a little money for my existing laptops which might make up the difference.</p>",
        "id": 486254291,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1733389055
    },
    {
        "content": "<p>Personally I put a lot of value on not maintaining two machines for work. So if I wanted to work both upstairs and downstairs, and while travelling, I would strive to only have one laptop but also <em>only have one cable coming out of the laptop</em> when at my desk.</p>\n<p>Then it's only one cable to unplug when you want to move. Still a bit of hassle bringing it up and downstairs, and having to move windows back to the right screen sometimes, but for me at least that's less hassle than maintaining two laptops, or having to deal with wanting to go up/downstairs but I'm in the middle of writing some code that would then be on the wrong laptop (sometimes you just don't want to commit and push at that moment).</p>\n<p>If downstairs is mainly for streaming and casual use then I would keep the M1 Air for that, but still use the new M4 macbook for the occasions I wanted to work downstairs.</p>",
        "id": 486285218,
        "sender_full_name": "James Thurley",
        "timestamp": 1733398922
    },
    {
        "content": "<p>Yes to a single machine for work. Macbook Pro and unplug and go. I use the BookArc from Twelve South to cradle my mbp at my desktop. I plug in the monitor via USB-C as well as my Wacom. Then it's a desktop.</p>\n<p>I've considered the mac mini way for cost reasons...cause, wow, I really don't like to spend $4k on a machine. We I/use a lot of storage so I tend to get 2TB or more of storage so the price jumps accordingly. I'll probably go smaller in the future and use a bus powered external drive like OWC Envoy Ultra to expand if needed.</p>",
        "id": 486343011,
        "sender_full_name": "Adam Stacoviak",
        "timestamp": 1733415223
    },
    {
        "content": "<p>I have seen people take apart the mini and apparently you can upgrade the drive. I presume third parties will make the appropriate drives but of course this will void your warranty.</p>\n<p>If I am only going to get one device I think I might hold out for the macbook air. I am really enjoying my m1 air. That means waiting for a couple of months but that's no big deal. Hell maybe I can get a used m1,2 or 3 mac mini for super cheap too. I'll look around.</p>",
        "id": 486390451,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1733431466
    },
    {
        "content": "<p>Just to close the loop. I sold all the crumbs of bitcoins I had and made enough money to buy both a mac mini and a macbook air when it comes out. I splurged on a 24gb, 512 HS combo but not the pro chip.  Looking at my memory usage it seems like I run close to 16GB a lot. Chrome seems to be a big culprit so I really need to start using safari more I think. </p>\n<p>Now I have to sell the intel macbook pro which is going to be hard since apple started displaying the \"battery needs to be replaced\" message.</p>",
        "id": 486702876,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1733604261
    },
    {
        "content": "<p>I’m reconsidering splurging on a new MacBook Pro. I’m tempted now to go up to 64gb+ for the ram since <a href=\"https://ollama.com/library/llama3.3\">llama3.3</a> is claiming the same performance as chatgpt 4o</p>",
        "id": 486759998,
        "sender_full_name": "Dustin",
        "timestamp": 1733656035
    },
    {
        "content": "<p>The price tag though <span aria-label=\"sob\" class=\"emoji emoji-1f62d\" role=\"img\" title=\"sob\">:sob:</span></p>",
        "id": 486760157,
        "sender_full_name": "Dustin",
        "timestamp": 1733656141
    },
    {
        "content": "<p>Just gonna have wait for optimizing to optimize</p>",
        "id": 486760177,
        "sender_full_name": "Dustin",
        "timestamp": 1733656160
    },
    {
        "content": "<p>Unlike hard drives you can't get external memory so you have to pay for it up front. Mac mini might be a good choice though, it's much cheaper.</p>",
        "id": 486803949,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1733692536
    },
    {
        "content": "<p>External drives can be as fast as internals, though with thunderbolt 5￼</p>",
        "id": 486821222,
        "sender_full_name": "Adam Stacoviak",
        "timestamp": 1733707652
    },
    {
        "content": "<p>For sure! I’m hitting the end of my current 1TB and wondering how much effort it is to keep it that way or if I need to spend more to get a 2TB</p>",
        "id": 486928151,
        "sender_full_name": "Dustin",
        "timestamp": 1733731606
    },
    {
        "content": "<p>I think of it like hot, warm, and cold storage. Building and managing a NAS could help with warm and cold items. Hot and some warm can be on machine. While others could be a direct attached external or NAS accessible.</p>",
        "id": 486929783,
        "sender_full_name": "Adam Stacoviak",
        "timestamp": 1733732123
    },
    {
        "content": "<p>Oddly enough none of my computers are holding more than 256 gigs of data. I suspect this is because I offload so much to the cloud. Between google drive, mega, dropbox, and icloud free tiers I have plenty of storage offline for all my needs. </p>\n<p>BTW MEGA gives you fifty gigs of free storage. That's a lot!</p>",
        "id": 487101290,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1733779176
    },
    {
        "content": "<p>I think what I am going to do is to get an external drive and mirror all my cloud storage on to it and then share it from the mac mini. That will give me a NAS of sorts where all the data is automatically backed up. I will set up a directory for each cloud service so I can monitor the usage and rebalance when needed.</p>",
        "id": 487101600,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1733779267
    },
    {
        "content": "<p>Here is something weird.  when I ordered the mac mini I ordered the 24 gigs of RAM because when I looked at my 16 gig macbook pro it used up 12 gigs just running chrome and a couple of youtube tabs.  Yesterday I got my mac mini and just running chrome it's using more than 16 gigs of ram.  Looking at the activity monitor the biggest users of ram are the wallpaper (huh?) but I suspect what's happening is that some processes are grabbing up all the ram they can but will release it as pressure builds up.</p>\n<p>Quite strange.</p>",
        "id": 488187156,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1733950700
    },
    {
        "content": "<p>I might need to follow Chris' lead on this... <a href=\"https://chriscoyier.net/2025/01/06/m4/\">https://chriscoyier.net/2025/01/06/m4/</a></p>",
        "id": 493405229,
        "sender_full_name": "Jerod Santo",
        "timestamp": 1736788824
    }
]