[
    {
        "content": "<p>Anyone else reading/read <em>Careless People</em> by Sarah Wynn-Williams? Made a splash back in March when Facebook caused a Streisand Effect by fighting against it. I'm late to the party, so a lot of the biggest revelations/accusations have already been spoiled for me.</p>\n<p>Now that I'm out of reliving the idealist early-2010s phase and into unethical misadventures with dictators and billionaires it's feeling more like a slog. I just immediately assume they're going to do the worst possible thing.</p>\n<p>Also, while I'm giving her a fair amount of credence (probably because what's she's saying aligns with my current feelings about the company, social media in general, etc.), I'm aware that the implicit goal of a memoir is to make the author look good (or at least sympathetic). She's portraying herself as a socially awkward fish-out-of-water at the same time as being someone capable of moving in diplomatic circles and balancing different leaders' national goals and obligations. Or she's in the middle: the only \"normal\" person around who's willing to say what everyone else is thinking (or too naive to know better).</p>\n<p>I'll probably push through because this feels like something we have a responsibility to read, but I'm finding it hard to go back to. Anyone else?</p>",
        "id": 532936233,
        "sender_full_name": "Andrew O'Brien",
        "timestamp": 1754406339
    },
    {
        "content": "<p>I had listened to the audiobook back in May and had a similar feeling. The author keeps harping on about how she could not leave the organization because she thought she could do more good from the inside (haven't we all heard that before).</p>\n<p>However, keeping the I'm-not-a-perpetrator-but-a-victim vibe aside, I still thought it was powerful for her to come out so publicly and document the inner belly of Facebook. We've all heard the stories but it always comes from \"anonymous sources\" because nobody wants to commit a career suicide by writing even a critical blog post about their former employer, let alone a book.</p>\n<p>I'd still recommend this, mostly for her courage to put her name to it.</p>",
        "id": 533046120,
        "sender_full_name": "Siddhartha Golu",
        "timestamp": 1754467327
    },
    {
        "content": "<p>Okay, done. I feel about the same about it now as I did then. So my recommendation would be if you're struggling around halfway and already know about Facebook's role in the Rohingya genocide, ads explicitly targeted to teenagers when they're in emotionally vulnerable states, and predictably hypocritical realities around how they treat sexual harassment claims, you probably won't learn anything particularly new.</p>\n<p>That said, I'm glad she wrote it and it's out there.</p>",
        "id": 536443454,
        "sender_full_name": "Andrew O'Brien",
        "timestamp": 1756307730
    },
    {
        "content": "<p>I got  3 Free Audible credits. Ansy suggestions which book should i purchase.<br>\nI'm completely beginnerin Books and Audi Books.</p>\n<p>Reviews on: surrounded by idiots</p>",
        "id": 537000249,
        "sender_full_name": "Dixit Ram",
        "timestamp": 1756665556
    },
    {
        "content": "<p>What kind of books? I'll always recommend Stormlight Archives (Way of Kings is book 1) for someone who likes fantasy. I don't use Audible anymore but each book is over 40h of content and only one credit. Plus they're well written and have good voice actors</p>",
        "id": 537003519,
        "sender_full_name": "Lars Ellingsen",
        "timestamp": 1756668756
    },
    {
        "content": "<p>Thanks, I am into want fantacy or story type.i want like motivation or like that...?</p>",
        "id": 538698319,
        "sender_full_name": "Dixit Ram",
        "timestamp": 1757522845
    }
]