[
    {
        "content": "<p><a href=\"/user_uploads/66849/Bqc10JQ0Z32ViudjpJDaOukS/IMG_4741.jpg\">IMG_4741.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/66849/Bqc10JQ0Z32ViudjpJDaOukS/IMG_4741.jpg\" title=\"IMG_4741.jpg\"><img data-original-content-type=\"image/jpeg\" data-original-dimensions=\"2342x3769\" src=\"/user_uploads/thumbnail/66849/Bqc10JQ0Z32ViudjpJDaOukS/IMG_4741.jpg/840x560.webp\"></a></div>",
        "id": 562383186,
        "sender_full_name": "jslovato",
        "timestamp": 1765166153
    },
    {
        "content": "<p>weird to think that the iPhone might not have existed without the success of the iPod ...</p>",
        "id": 562386016,
        "sender_full_name": "Ron Waldon-Howe",
        "timestamp": 1765168611
    },
    {
        "content": "<p>I just wish mac os would handle this device as a first class citizen. Apple in general fiddles so much they don't care about 2 weeks ago, let alone 15 years ago.</p>",
        "id": 562541804,
        "sender_full_name": "jslovato",
        "timestamp": 1765221455
    },
    {
        "content": "<p>LOL. Nobody cares about 15 year old technology.</p>",
        "id": 571562270,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1770087681
    },
    {
        "content": "<p>I was just pondering this while walking my dog. I think we have unrealistic expectations of tech companies. The company that makes my washing machine doesn't make that model anymore, neither does the company that makes my TV, my shoes, my jackets, my doorknobs, my water bottle, my couch, my dishes, my drill etc. In many cases those companies don't even exist after 15 years let alone make the same models.</p>\n<p>On a similar note.</p>\n<p>About 20 years ago I bought a jacket from a NZ company. It's been a great jacket and despite regular use for all those years it's in excellent condition.  The company is still around and still sells clothing but there is no way anything they make today is going to last 20 years. They don't make them in NZ anymore, they don't have the same management, they don't have the same employees, they don't even have the same shareholders. </p>\n<p>Shame really.</p>",
        "id": 571566083,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1770090645
    },
    {
        "content": "<p>corporations cut all sorts of corners whilst their stocks are high-growth, or in order to try to make their stocks high-growth<br>\nor when their stocks are spiralling and they're desperate</p>",
        "id": 571602395,
        "sender_full_name": "Ron Waldon-Howe",
        "timestamp": 1770108737
    },
    {
        "content": "<p>exposure to speculative investors ruins everything</p>",
        "id": 571604069,
        "sender_full_name": "Ron Waldon-Howe",
        "timestamp": 1770109226
    },
    {
        "content": "<p>Capitalism ruins everything :) But I don't really blame them. This jacket I love so much is so nice I have never bought another jacket from them.  I have bought other kinds of jackets from other manufacturers though. This one is rugged and heavy so I don't wear it every day.</p>",
        "id": 571754971,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1770150098
    },
    {
        "content": "<p>Oh and I guess I should shill for them a bit. This is the company <a href=\"https://www.hunterselement.co.nz/\">https://www.hunterselement.co.nz/</a> I think they also sell in Australia but I don't know if they sell anywhere outside of that. Maybe online?</p>",
        "id": 571755651,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1770150335
    }
]