[
    {
        "content": "<p>The latest episode was a little frustrating to listen to because both sides of the argument were making generalizations that didn't strike me as being true.  </p>\n<p>One example was that the AI would be more accurate and make less mistakes than a human which we know isn't true and the other was that humans would be more ethical and moral which we also know is not true.</p>\n<p>In any case we have seen AI deployed both in Ukraine and Gaza and the results have been horrific to say the least. </p>\n<p>They didn't address my main concern which is that AI will make war cheaper and easier to wage and more entertaining to watch which will in turn lead to countries using war to get what they want more often.</p>\n<p>One thing for sure watching the horrific images and videos coming out of gaza has broken me as a human being and destroyed what little faith I had in humanity as a whole. This goes double for the so called \"western culture\". Seeing the reactions of the USA, Europe and the UK as the horrors unfold before our eyes has shown the world the true face of the west.</p>",
        "id": 526339642,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1751270042
    },
    {
        "content": "<p>I wouldn't trust the self reported data from Uber or Tesla, but other self driving efforts do seem to be making fewer mistakes than humans when comparing distances covered <br>\nI don't think it's always true that AI is always worse, especially as they aren't deploying generative AI here, which has certainly tarnished the entire field</p>",
        "id": 526486310,
        "sender_full_name": "Ron Waldon-Howe",
        "timestamp": 1751317315
    },
    {
        "content": "<p>I agree about everything else though: adding more technology to warfare isn't likely to result in better decision making by humans</p>",
        "id": 526486833,
        "sender_full_name": "Ron Waldon-Howe",
        "timestamp": 1751317567
    },
    {
        "content": "<p>Really, we ought to revert warfare back to swords and shields, with leaders that declare wars right on the front lines alongside their troops <br>\nI feel this is the only way to make war a last resort</p>",
        "id": 526487061,
        "sender_full_name": "Ron Waldon-Howe",
        "timestamp": 1751317689
    },
    {
        "content": "<p>I have watched several videos of self driving videos in china and they seem to do an amazing job there. The Huawei system seems to be especially remarkable given some of the cars they were riding in were a couple of years old already. BYD announced that all their cars from now on will have self driving including their cheapest models which cost about $8000 USD in China.</p>",
        "id": 526487244,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1751317779
    },
    {
        "content": "<p>As for warfare I think it's a different scenario. AI allows humans to shirk responsibility for killing people and in fact turns it into a spectator sport (even more than it is now). As I mentioned before  It makes war cheaper, easier, and more fun just like self driving will make transportation cheaper, easier and more fun.</p>",
        "id": 526487429,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1751317893
    },
    {
        "content": "<p>This is heartbreaking, but I think there's a fundamental misunderstanding about \"safeguards\" in generative AI: <a href=\"https://arstechnica.com/tech-policy/2025/08/chatgpt-helped-teen-plan-suicide-after-safeguards-failed-openai-admits/\">https://arstechnica.com/tech-policy/2025/08/chatgpt-helped-teen-plan-suicide-after-safeguards-failed-openai-admits/</a></p>",
        "id": 536304072,
        "sender_full_name": "Ron Waldon-Howe",
        "timestamp": 1756238443
    }
]