[
    {
        "content": "<p>Go Time co-host, Johnny Boursiquot, joins Adam &amp; Jerod to discuss not making the (first) cut, applying Founder Mode, being a cog (or not), realizing that companies are posting fake engineering jobs &amp; the (maybe) imminent demise of the .io TLD.</p>\n<p><span aria-label=\"link\" class=\"emoji emoji-1f517\" role=\"img\" title=\"link\">:link:</span> <a href=\"https://changelog.com/friends/65\">https://changelog.com/friends/65</a></p>",
        "id": 476447000,
        "sender_full_name": "Logbot",
        "timestamp": 1728675008
    },
    {
        "content": "<p>“I’m afraid of bears” might be the best opener of all time.</p>",
        "id": 476470219,
        "sender_full_name": "Adam Stacoviak",
        "timestamp": 1728687433
    },
    {
        "content": "<p>If you want to spend 15 minutes learning a little more about TLDs, the Economics of Everyday Things (Freakonomics network) did an episode not long ago: <a href=\"https://freakonomics.com/podcast/top-level-domains/\">https://freakonomics.com/podcast/top-level-domains/</a></p>",
        "id": 477119430,
        "sender_full_name": "Lars Ellingsen",
        "timestamp": 1729052736
    },
    {
        "content": "<p>Random thoughts that occurred to me.</p>\n<p>Anybody who has been in the military knows nobody is indispensable.  People in the military come and go all the time whether it's due to reassignment, promotion, or ending their service from the bottom to the commander in chief. Despite all that the institution goes on.</p>\n<p>Any \"founder\" or CEO or manager that builds a team where the loss of one person would have a significant impact on running the business has failed.</p>\n<p>What good would a second or third or fifth lynchpin do on a wagon wheel?</p>\n<p>How would you build a wheel with only lynchpins? You also need spokes and of course that iron plate on the rim that get to be smashed continuously on the rocks and dirt.  Now there is an analogy for you. Who are those people in your organization? The spokes that hold the rim and the iron plate on the rim which gets all the wear and tear and is mainly designed to suffer.</p>",
        "id": 477521924,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1729198079
    },
    {
        "content": "<p>I’m imagining the rim as first line support, with the customers trying to smash their way through to talk to the people further in.</p>",
        "id": 477586670,
        "sender_full_name": "James Thurley",
        "timestamp": 1729234753
    },
    {
        "content": "<p>Yep.  They are the front line troops aren't they. Much under appreciated, under paid, abused by all and loved by none.</p>",
        "id": 477725717,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1729281323
    }
]