[
    {
        "content": "<p>Hello, friends! </p>\n<p><span class=\"user-mention\" data-user-id=\"750017\">@Adam Stacoviak</span> and I decided to make some big changes in the new year that will probably come as a surprise. This is a bittersweet announcement for sure, but we truly believe it'll be bitter at first but much more sweet in the long-run.</p>\n<p>Please read this post when you have some spare time and share your reactions/questions here or in the post's comments:</p>\n<p><a href=\"https://changelog.com/posts/a-new-era-for-the-changelog-podcast-universe\">https://changelog.com/posts/a-new-era-for-the-changelog-podcast-universe</a></p>\n<p>We will certainly be discussing this in more detail on the next Kaizen episode as well as on the finale episodes coming this month. <span aria-label=\"green heart\" class=\"emoji emoji-1f49a\" role=\"img\" title=\"green heart\">:green_heart:</span><span aria-label=\"green heart\" class=\"emoji emoji-1f49a\" role=\"img\" title=\"green heart\">:green_heart:</span><span aria-label=\"green heart\" class=\"emoji emoji-1f49a\" role=\"img\" title=\"green heart\">:green_heart:</span></p>",
        "id": 486405083,
        "sender_full_name": "Jerod Santo",
        "timestamp": 1733438110
    },
    {
        "content": "<p>This is huge! I trust you guys to do a great job. I hope the extended Changelog family on the topic-specific shows we love are coming along for the ride <span aria-label=\"pray\" class=\"emoji emoji-1f64f\" role=\"img\" title=\"pray\">:pray:</span></p>",
        "id": 486422936,
        "sender_full_name": "Daniel Buckmaster",
        "timestamp": 1733448460
    },
    {
        "content": "<p>Eek, ShipIt is on Substack, isn't that a Nazi bar given that they refuse to moderate Nazi content?<br>\nWhy not open-source equivalents like <a href=\"https://write.as/\">https://write.as/</a> or <a href=\"https://ghost.org/\">https://ghost.org/</a> or something?</p>",
        "id": 486425142,
        "sender_full_name": "Ron Waldon-Howe",
        "timestamp": 1733449865
    },
    {
        "content": "<p><a href=\"https://www.theverge.com/2023/12/21/24011232/substack-nazi-moderation-demonetization-hamish-mckenzie\">https://www.theverge.com/2023/12/21/24011232/substack-nazi-moderation-demonetization-hamish-mckenzie</a></p>",
        "id": 486425199,
        "sender_full_name": "Ron Waldon-Howe",
        "timestamp": 1733449909
    },
    {
        "content": "<p>Otherwise, the structural changes are fascinating<br>\nI'm unfortunately a month behind on episodes, but I'm keen to catch up and experience the improvements in the new format, yay!</p>",
        "id": 486425399,
        "sender_full_name": "Ron Waldon-Howe",
        "timestamp": 1733450033
    },
    {
        "content": "<p>Any idea how Changelog++ memberships will have an impact? Are those only going to affect the core shows, or affiliated ones too?</p>",
        "id": 486426902,
        "sender_full_name": "Lars Ellingsen",
        "timestamp": 1733450907
    },
    {
        "content": "<p>Could this get also posted onto the site's top-level feed ie <a href=\"https://changelog.com/\">https://changelog.com/</a> ? Didn't see this post in my RSS feed, only spotted it via Justin's BlueSky post</p>",
        "id": 486493482,
        "sender_full_name": "Jamie Tanna",
        "timestamp": 1733484435
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"752880\">Lars Ellingsen</span> <a href=\"#narrow/channel/453512-general/topic/A.20new.20era.20for.20the.20Changelog.20Podcast.20Universe/near/486426902\">said</a>:</p>\n<blockquote>\n<p>Any idea how Changelog++ memberships will have an impact?</p>\n</blockquote>\n<p>In the short-term, ++ will apply/support The Changelog only. We may evolve it to include CPU pods as well, but it's all very nascent at the moment.</p>\n<p><span class=\"user-mention\" data-user-id=\"755984\">@Jamie Tanna</span> we're going to discuss this on Kaizen, on every individual podcast's finale episodes, cover it in News, etc.</p>",
        "id": 486518396,
        "sender_full_name": "Jerod Santo",
        "timestamp": 1733492657
    },
    {
        "content": "<p>Yeah this is really big change and while the knee jerk reaction is \"Nooooo! How can you do this to me!\" <span aria-label=\"crying cat\" class=\"emoji emoji-1f63f\" role=\"img\" title=\"crying cat\">:crying_cat:</span>  I'm sure it will be good in the end. <span aria-label=\"green heart\" class=\"emoji emoji-1f49a\" role=\"img\" title=\"green heart\">:green_heart:</span>   </p>\n<p>I have really liked having access to all the content from one \"firehose\" feed, from a source I could trust with my contact details.<br>\nNow I will have to go out and share my details with  different platforms and possibly get more subscriptions. I guess it is not just about the money, but I would be happier to pay more to one source than have to sign up for more accounts. In the end I will probably drop one or more of the podcasts that I'm 100% interested in all the time. Still with the master feed it was educational and fun to get them \"in my earholes\" anyway and it broaden my horizon.</p>",
        "id": 486552847,
        "sender_full_name": "Pontus Ullgren",
        "timestamp": 1733503014
    },
    {
        "content": "<p>Oh, that's an ominous title after a year of \"A Message to Our Community about the Future of [Corporate Open Source Project We All Rely On But Don't Pay For]\" news...</p>\n<p>I guess I'm not understanding what the functional difference between status quo and <a href=\"http://CPU.fm\">CPU.fm</a> will be and how that lightens the production load? Are the spin-off shows responsible for their own audio production? Hosting? Ad sales? Community engagement tools? What level of support will they still get from the network?</p>",
        "id": 486568154,
        "sender_full_name": "Andrew O'Brien",
        "timestamp": 1733507995
    },
    {
        "content": "<p>Yes the spinoffs are all entirely independent podcasts that we don’t own/operate</p>",
        "id": 486581276,
        "sender_full_name": "Jerod Santo",
        "timestamp": 1733513282
    },
    {
        "content": "<p>Support will be ad sales, promotion, collabs, aggregation</p>",
        "id": 486581347,
        "sender_full_name": "Jerod Santo",
        "timestamp": 1733513306
    },
    {
        "content": "<p>For those interested in AI I would reccomend Latent Space podcast.  The only other podcast on the chopping block I listen to is gotime but only because I enjoy the banter when Matt is on. Other times it's less enjoyable to me. I might not even look for an alternative as I don't code in Go anymore even though I am peripherally interested in the language.</p>\n<p>BTW totally unrelated but I would highly recommend the Mindscape podcast by the physicist and philosopher Dr. Sean Carrol. IMHO it's the best podcast out there.   Diverse topics, top notch guests, highly intellectual conversations and monthly AMAs where the professor answers all questions asked by patreon supporters.</p>",
        "id": 486591520,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1733517769
    },
    {
        "content": "<p>I loved his lecture on time that's on Audible.</p>",
        "id": 486591917,
        "sender_full_name": "Adam Stacoviak",
        "timestamp": 1733517965
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"755905\">@Tim Uckun</span> you can look forward to plenty more from Mat on upcoming Changelog &amp; Friends episodes <span aria-label=\"sunglasses\" class=\"emoji emoji-1f60e\" role=\"img\" title=\"sunglasses\">:sunglasses:</span></p>",
        "id": 486594805,
        "sender_full_name": "Jerod Santo",
        "timestamp": 1733519289
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"750170\">Jerod Santo</span> <a href=\"#narrow/channel/453512-general/topic/A.20new.20era.20for.20the.20Changelog.20Podcast.20Universe/near/486581276\">said</a>:</p>\n<blockquote>\n<p>Yes the spinoffs are all entirely independent podcasts that we don’t own/operate<br>\nSupport will be ad sales, promotion, collabs, aggregation</p>\n</blockquote>\n<p>So, sounds like Maximum Fun?</p>\n<p>(Which I think is a pretty good model of a podcast network, so I’m saying that as a positive comparison.)</p>",
        "id": 486596958,
        "sender_full_name": "Andrew O'Brien",
        "timestamp": 1733520260
    },
    {
        "content": "<p>It’s a very versatile model with so much possibility and potential.</p>",
        "id": 486613075,
        "sender_full_name": "Adam Stacoviak",
        "timestamp": 1733529777
    },
    {
        "content": "<p>Congratulations Adam and Jerod! I know we spoke about this in person a few weeks ago but nice to see the announcement and the vision for <a href=\"http://CPU.fm\">CPU.fm</a>.</p>\n<p>It's a healthy thing when a company refocuses on its main thing rather than trying to do too much and potentially lose quality. Thank you for letting people spin off the podcasts. I'll be on <a href=\"http://fallthrough.fm\">fallthrough.fm</a> with Kris and Ian.</p>\n<p>Godspeed!</p>",
        "id": 486680048,
        "sender_full_name": "Matthew Sanabria",
        "timestamp": 1733586007
    },
    {
        "content": "<p>This sounds like a good move to me, I like the idea of focussing in on the core Changelog experience. </p>\n<p>I've occasionally wondered if you guys could turn the podcasting infrastructure you've created into a service for other podcasts, both to earn some extra money from it, and benefit other podcasters. Could be quite a nice open-source business and make good use of all the attention to detail that goes into your podcasting infrastructure. Reading between the lines, it sounds like CPU could be that kind of thing.</p>",
        "id": 486763214,
        "sender_full_name": "Hal Blackburn",
        "timestamp": 1733658690
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"771585\">Ron Waldon-Howe</span> <a href=\"#narrow/channel/453512-general/topic/A.20new.20era.20for.20the.20Changelog.20Podcast.20Universe/near/486425142\">said</a>:</p>\n<blockquote>\n<p>Eek, ShipIt is on Substack, isn't that a Nazi bar given that they refuse to moderate Nazi content?<br>\nWhy not open-source equivalents like <a href=\"https://write.as/\">https://write.as/</a> or <a href=\"https://ghost.org/\">https://ghost.org/</a> or something?</p>\n</blockquote>\n<p>I totally hear you about the concerns. Substack isn’t going to be our permanent home and I’ll probably shut it down once we get the permanent page set up. I just wanted some way to collect email signups when the announcement went out so we could email people once the site and feeds are ready.</p>\n<p>we should have that sometime next week</p>",
        "id": 486796360,
        "sender_full_name": "Justin Garrison",
        "timestamp": 1733686055
    },
    {
        "content": "<p>Ended up writing some thoughts in medium-form at <a href=\"https://www.jvt.me/posts/2024/12/08/changelog-cpu/\">https://www.jvt.me/posts/2024/12/08/changelog-cpu/</a> but TL;DR is hopeful, but a little apprehensive of change!</p>",
        "id": 486806305,
        "sender_full_name": "Jamie Tanna",
        "timestamp": 1733694672
    },
    {
        "content": "<p>I love this. I think what we’re doing with CPU will be an amazing thing in the long run. Thank you for listening and trusting us all these years. We don’t take that loyalty and commitment lightly. We’re working hard to make sure we’ve got the main thing on lock, and a bright future planned for <a href=\"http://CPU.fm\">CPU.fm</a>.</p>",
        "id": 486821149,
        "sender_full_name": "Adam Stacoviak",
        "timestamp": 1733707609
    },
    {
        "content": "<p>I'm excited that the team will be able to focus on the Changelog! It's already great. Can't wait to see Adam and Jerod improve it in ways I can't even imagine.<br>\nLike others have mentioned, not having the master feed will be a loss. I don't think I would normally be a subscriber to JS Party, but having it show up in the master gives me a good reason to listen to episodes here and there.<br>\nExcited for the change! Kaizen!</p>",
        "id": 486833727,
        "sender_full_name": "Sukhdeep Brar",
        "timestamp": 1733716591
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"755984\">@Jamie Tanna</span> I appreciate you taking time to write up your thoughts. Change is hard! We're all a <em>little</em> apprehensive, but the future is bright. (8 years, wow!)</p>\n<p><span class=\"user-mention\" data-user-id=\"759779\">@Sukhdeep Brar</span> our master feed would effectively turn in to <em>The Changelog</em> (meaning it'll be redundant/useless), but we'll probably redirect it to the upcoming CPU feed, which will give you that content diversity back (and then some).</p>",
        "id": 487020077,
        "sender_full_name": "Jerod Santo",
        "timestamp": 1733757051
    },
    {
        "content": "<p>This news break initially made me very sad but after I had some time to reflect, and also learning that my two favourite shows alongside the ChangeLog, namely ShipIt and GoTime, will keep on running but standing on their own legs, I did a 180. I think this is good, especially for <span class=\"user-mention\" data-user-id=\"750017\">@Adam Stacoviak</span> and <span class=\"user-mention\" data-user-id=\"750170\">@Jerod Santo</span> so they can keep making good quality pods with the ChangeLog w/o burning out or feeling that they have to release content to keep up with schedule, that they just haven't got the energy to make as good as they'd like to, or cutting out other important personal stuff from life to make the release schedule.</p>\n<p>I'd like to take this opportunity to thank Adam and Jerod for their perseverance over the years, your never ending stream of interesting angles on tech, your ability to make top quality interviews, news and just generally very nice podcasts. Thank you, guys! I hope this change will let you keep rolling out new stuff and stay happy and have time for family and other stuff off-mic. All the best!</p>",
        "id": 489504829,
        "sender_full_name": "Erik Svensson",
        "timestamp": 1734447360
    }
]