[
    {
        "content": "<p>There have been a slew of tech and announcements coming out of China in the last couple of months. We are all familiar with the AI models but in addition China has announced their intent to build thorium reactors including a thorium powered cargo ship design, One kilometer wide solar panels in space, an expansion to their space station, a space based telescope and intent to land on mars.  </p>\n<p>Additionally chinese cars have been embracing self driving so now in china even the cheapest cars are going to have self driving features (IIRC starting as low as 5000 USD).  </p>\n<p>It would be great to hear from the equivalent of the changelog podcast hosts in China who are up to date on all this stuff.</p>",
        "id": 506296638,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1742260197
    },
    {
        "content": "<p>It'd be cool to get Bunnie on an episode: <a href=\"https://en.m.wikipedia.org/wiki/Andrew_Huang_(hacker)\">https://en.m.wikipedia.org/wiki/Andrew_Huang_(hacker)</a></p>\n<p>They tend to have a China-inclusive perspective on technology and manufacturing</p>",
        "id": 506301352,
        "sender_full_name": "Ron Waldon-Howe",
        "timestamp": 1742262327
    },
    {
        "content": "<p>I was hoping there were some podcasters who specialized in tech space based inside of China.  Maybe somebody from Shenzen where the bulk of technological advances are happening.</p>",
        "id": 506310073,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1742266430
    },
    {
        "content": "<p>Well, Huang did write a book on that: <a href=\"https://www.bunniestudios.com/blog/2019/essential-guide-to-shenzhen-web-edition/\">https://www.bunniestudios.com/blog/2019/essential-guide-to-shenzhen-web-edition/</a></p>",
        "id": 506316364,
        "sender_full_name": "Ron Waldon-Howe",
        "timestamp": 1742269271
    },
    {
        "content": "<p>But yeah, I don't know how available they are for podcast interviews</p>",
        "id": 506316538,
        "sender_full_name": "Ron Waldon-Howe",
        "timestamp": 1742269345
    },
    {
        "content": "<p>I really like Dan Wang's year in review perspectives, the last one from <a href=\"https://danwang.co/2023-letter/\">2023 is here</a>. </p>\n<p>Additionally, <a href=\"https://x.com/dwarkesh_sp/status/1879354680498905335\">this question</a> by Dwarkesh had some interesting suggestions for people who might have deep insights on the current happenings in China.</p>",
        "id": 506324758,
        "sender_full_name": "Siddhartha Golu",
        "timestamp": 1742273966
    },
    {
        "content": "<p>I'll have to read that book on Shenzen and see how prescient it was.</p>\n<p>I have had the great fortune to travel and live in many countries and in my experience the best knowledge about a place is from natives who have live there. Even foreigners who have lived there a long time have a skewed perspective.   Of course every person will have their own perspective even if they are native to the country.</p>",
        "id": 506402162,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1742281752
    }
]