[
    {
        "content": "<p><a href=\"https://fortune.com/2025/08/14/data-centers-china-grid-us-infrastructure/\">https://fortune.com/2025/08/14/data-centers-china-grid-us-infrastructure/</a></p>",
        "id": 534716244,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1755293973
    },
    {
        "content": "<p>Really makes countries that are fighting tooth and nail to keep burning oil and coal look primitive by comparison <br>\nImagine if common sense energy independence/efficiency wasn't artificially partisan</p>",
        "id": 534751838,
        "sender_full_name": "Ron Waldon-Howe",
        "timestamp": 1755337195
    },
    {
        "content": "<p>Turns out, investing in infrastructure might actually be beneficial?</p>",
        "id": 534771622,
        "sender_full_name": "Lars Ellingsen",
        "timestamp": 1755360860
    },
    {
        "content": "<p>The infrastructure is crumbling in New Zealand too. I don't know why it's so hard to convince the governments (and the public) to spend money on maintaining and improving basic power infrastructure. I guess it's because it's invisible. We constantly clamour for roads but never for more resilient power lines. I guess we won't until the brownouts and the blackouts hit.</p>\n<p>With the coming wave of electric cars it's going to be even more important to increase both our generation and transmission capacity but alas nobody seems to be able to think that far ahead outside of China.</p>\n<p>If I were running New Zealand I would beg China to build a series of thorium reactors in NZ and strike a deal similar to the one struck by Russia in Turkey.  We kiwis are allergic to nuclear power but maybe telling people it's a molten salt reactor would ease their minds.  Hell we can just park them offshore if they used a different version of one of these.</p>\n<p><a href=\"https://www.nucnet.org/news/china-unveils-plans-for-largest-ever-container-ship-powered-by-thorium-reactor-1-5-2024\">https://www.nucnet.org/news/china-unveils-plans-for-largest-ever-container-ship-powered-by-thorium-reactor-1-5-2024</a></p>",
        "id": 534786534,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1755381412
    },
    {
        "content": "<p>Both fossil fuel cars and electric cars should have been considered temporary stop gaps in our history <br>\nSwitching folks over to electric cars tackles carbon emissions slightly, but doesn't touch broader issues like the extraordinary amount of wasted space that roads and car parks consume, the logistics of refueling/recharging, etc<br>\nWe need more cities that are already dense enough to become car-free zones in exchange for sufficient public transit options</p>",
        "id": 534795115,
        "sender_full_name": "Ron Waldon-Howe",
        "timestamp": 1755396442
    },
    {
        "content": "<p>Kiwis are even more allergic to living in apartments tough :). Everybody wants a single density three bedroom house with a garden.</p>",
        "id": 534849596,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1755468285
    }
]