[
    {
        "content": "<p>Hello Everyone, hope you guys are doing well.<br>\nI run a small remote dev shop. We build solid stuff: AI, Cloud, Web/Mobile, CMS (Shopify/WordPress/Wix), Designs, Data work… the kind that actually ships and doesn’t fall apart a month later<span aria-label=\"smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"smile\">:smile:</span><br>\nBut we’ve got a funny problem…<br>\nWe’re like a kitchen full of great chefs… and nobody loves walking out to the dining room to explain the menu.<br>\nUS clients usually love what we build, but interviews can get a little awkward because of language + cultural rhythm.<br>\nSo I’m looking for a US/Canada/UK/LatAm-based partner who’s comfortable talking with people and can be the friendly face on client calls.<br>\nSimple setup:<br>\nYou handle the client-facing side (calls, clarifying needs, keeping the relationship smooth)<br>\nI handle 100% of the technical work (architecture, coding, delivery)<br>\nYou earn 25–30% revenue share for each project you support<br>\nAnd to be super clear: this isn’t a heavy tech job. You don’t have to code — just be a clear communicator.<br>\nAlso — important note: you can use your own brand/name.<br>\n Some people don’t feel comfortable speaking under someone else’s identity (totally fair). If that’s you, we can onboard you officially so you can show up as yourself in every meeting and still keep the partnership model.<br>\nWe had a NYC-based partner for over a year — great run — and he ended up getting hired full-time by one of our clients (best exit story honestly).<br>\nSo now that seat is open again.<br>\nIf you’re down for a chill side gig that won’t wreck your schedule — and you like the idea of building something long-term — send me a message and I’ll share the details.<br>\nIf it’s not your vibe, no worries at all !<span aria-label=\"folded hands\" class=\"emoji emoji-1f64f\" role=\"img\" title=\"folded hands\">:folded_hands:</span><br>\nIf you are interested, DM me or message me on WhatsApp: +1 (702) 232-0366<br>\nOr send message to <a href=\"mailto:winblueforest@gmail.com\">winblueforest@gmail.com</a><br>\nAppreciate your reading  <span aria-label=\"raised hands\" class=\"emoji emoji-1f64c\" role=\"img\" title=\"raised hands\">:raised_hands:</span></p>",
        "id": 570322087,
        "sender_full_name": "John C",
        "timestamp": 1769521040
    }
]