[
    {
        "content": "<p>I've been thinking a bit about this new era of video-first Changelog.</p>\n<p>Sometimes I listen to the Changelog when video isn't practical, like when I'm shopping, or when I'm driving. Sometimes I'm listening when I can occasionally look at the screen, such as in the gym, or doing the washing up.</p>\n<p>For the latter I might consider putting the video versions on, except that switching between YouTube and my podcast player depending on the situation isn't really practical, especially if I'm mid-way through an episode.</p>\n<p>Always using YouTube, even for audio-only, isn't really practical as it stops if I turn off my screen, and I don't think CarPlay supports it.</p>\n<p>What would be great is if my podcast player could support playing video if it's available.  Surprisingly (to me!) this <a href=\"https://podcasters.apple.com/support/3684-video-podcasts\">does</a> <a href=\"https://support.pocketcasts.com/knowledge-base/video-podcasts/\">exist</a>. Is the intention to support this?</p>\n<p>Also what's the plan for Changelog++ and video?</p>\n<p>I'm happy sticking with audio-only for now, but curious if there are practical solutions to this.</p>",
        "id": 494119567,
        "sender_full_name": "James Thurley",
        "timestamp": 1737025991
    },
    {
        "content": "<p>Is changelog video first?</p>",
        "id": 494141632,
        "sender_full_name": "Dustin",
        "timestamp": 1737032770
    },
    {
        "content": "<p>In their announcement post they said they're \"moving beyond clips and shorts and leaning into a video-first production\".</p>",
        "id": 494153308,
        "sender_full_name": "James Thurley",
        "timestamp": 1737036015
    },
    {
        "content": "<p>Yes, we are doing all three of our shows (News, Interviews, Friends) in full video from here on out. For now we're just posting to YouTube. I can imagine a world where we do more, but I think the list of people watching video podcasts on Apple/Spotify is small enough that it's not worth that effort at the moment.</p>\n<p><em>(If I'm wrong about that, please let me know!)</em></p>\n<p>I don't think there's much value-add to existing audio listeners like yourselves, honestly. Maybe there's an episode here or there (our game shows which include a game board come to mind) that's better enough in video that you want to search that out on YT and watch it.</p>\n<p>The goal with going full video is being able to reach new folks who haven't yet realized how great the audio podcast lifestyle is yet. One of our mantras is \"go where the people are\" and we haven't gone all-in on YT in the past only due to production constraints. With our streamlined show lineup we can do that now.</p>",
        "id": 494157448,
        "sender_full_name": "Jerod Santo",
        "timestamp": 1737037124
    },
    {
        "content": "<p>It's been a growing concern for me! Everyone seems to be shifting to having video, but I very explicitly see podcasts as a very different activity from video. So imagine in the future the ones that truly become \"video-first\" I'll slowly let go of rather than continue to tune in for.</p>\n<p>But it sounds like that's not the plan for Changelog <span aria-label=\"relieved\" class=\"emoji emoji-1f60c\" role=\"img\" title=\"relieved\">:relieved:</span></p>",
        "id": 494229414,
        "sender_full_name": "Dustin",
        "timestamp": 1737060173
    },
    {
        "content": "<p>I favor video when available because it's nice to put faces, body language, etc to the show. Audio only is fine but for the longest time I couldn't tell your voices apart. Plus video opens up episodes like \"what's on my desk\".</p>",
        "id": 494283207,
        "sender_full_name": "Matthew Sanabria",
        "timestamp": 1737089670
    },
    {
        "content": "<p>I prefer audio podcasts as well. Last year, Changelog topped my list with 69 episodes (a total of 2d12h31min, according to Pocket Casts' year in review). I usually listen while walking my dog or on the subway. If it switches to video-only, I’ll likely consume much less Changelog content, which would be a significant loss for me.</p>",
        "id": 494376781,
        "sender_full_name": "Daniel Serodio",
        "timestamp": 1737125341
    },
    {
        "content": "<p>We're not switching to video-only. We're moving to video-first, with both audio and video artifacts out the other end. Audio is here to stay with no changes.</p>",
        "id": 494387509,
        "sender_full_name": "Adam Stacoviak",
        "timestamp": 1737128541
    },
    {
        "content": "<p>Yeah, video probably isn't going to be a draw for me. Most of my podcast consumption is while driving, doing dishes, or some kind of other work that I need to look at, but isn't intellectually engaging.</p>\n<p>But no shade on anyone who would prefer to watch and I'm glad you all are trying new things to grow the audience (as long as the quality on the audio-only forms doesn't drop, which I have no reason to believe it will).</p>",
        "id": 494387850,
        "sender_full_name": "Andrew O'Brien",
        "timestamp": 1737128644
    },
    {
        "content": "<p>I like to have the option, when i'm on a computer usually i watch the video, but when i'm cooking or driving or cleaning the house, it's always audio.</p>",
        "id": 494391897,
        "sender_full_name": "cevado",
        "timestamp": 1737129805
    },
    {
        "content": "<p>In my most recent experience with podcasts that ended up switching to video/audio they end up performing a really awkward dance in the content which ends up deteriorating the audio feed.</p>\n<p>\"If you're driving... pull over and check out the video feed\" is usually how this ends up.</p>",
        "id": 494411039,
        "sender_full_name": "Frank West",
        "timestamp": 1737136482
    },
    {
        "content": "<p>VS never having a visual context at all? I don't see that as a dance, but more so the literal limitations of audio only. The alternative is \"check for a link in the show notes.\"</p>",
        "id": 494414368,
        "sender_full_name": "Adam Stacoviak",
        "timestamp": 1737137748
    },
    {
        "content": "<p>Yeah but that’s okay. Because it often leads to the speaker giving an overview and the value of going to the link. Whereas in the “pullover to watch video” they tend to start speaking like “when I click on this” or “this thing moves around” etc and as a audio listener with your hands full you’re just like “I wish I could skip this chapter of no value to me”</p>\n<p>FWIW, I don’t think it’s insurmountable but it’s not really a skill most podcast turn videos have succeeded on.</p>",
        "id": 494420145,
        "sender_full_name": "Dustin",
        "timestamp": 1737139931
    },
    {
        "content": "<p>We're certainly going to what we can to navigate that as best we can.</p>",
        "id": 494421745,
        "sender_full_name": "Adam Stacoviak",
        "timestamp": 1737140451
    },
    {
        "content": "<p>FWIW, I think of Fallthrough as both a video and an audio podcast, but I see them as two separate entities. Mostly because I don't think there are many people who will consume both versions.</p>\n<p>The split primarily comes down to editing: the amount of editing one can do with audio vs video. You can't cut out nearly as much stuff with the video version (without cutaways, a ridiculous number of J and L cuts, or a nauseating number of jump cuts).</p>\n<p>The assumptions of consumers are also different: with audio a 1 second pause feels awkward, but with video when you can see the person thinking it doesn't seem as strange.</p>\n<p>With this split, there's also room for cutting segments out of the audio podcast that don't work without the visuals. Those can be released as clips and put in the audio version's show notes. The host or producer can call out those segments so people know they exist.</p>",
        "id": 494421885,
        "sender_full_name": "Kris Brandow",
        "timestamp": 1737140500
    },
    {
        "content": "<p>I listen to podcasts in the car or when I am walking the dog. The video may be nice to refer to if you guys are sharing a screen or whatnot but I hope you always keep the audio audience in mind when discussing visual things.</p>",
        "id": 494440278,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1737148031
    },
    {
        "content": "<p>I'm honestly shocked at the pushback. Especially when it wasn't announced that it would be video only, but rather video first.</p>\n<p>Most of my podcast listening is audio only out of physical necessity since my eyes are elsewhere (driving) or I'm not in front of a screen (cooking, cleaning).</p>\n<p>However, video is still preferred to me when I can watch it. I like to see the facial expressions and artifacts that are being discussed. For example, pulling up a screenshot of something that's being discussed. Changelog does a pretty good job of describing things for audio only but the rest is up to the show notes that I've never once went back to check out or click on. Video solves that since I can see the artifact while I'm consuming the content. I'm not remembering that the show note referred to time 15:47 when they were talking about Foo. I've already listened to the episode and I'm gone.</p>",
        "id": 494454491,
        "sender_full_name": "Matthew Sanabria",
        "timestamp": 1737154884
    },
    {
        "content": "<p>Like many others, podcasts to me are mostly an intellectual complement to the execution of menial tasks. Therefore, I imagine myself still consuming vast majority of the content in audio. The situations in which I expect a profound change for the better for people like myself are when the episode is a game show or when it's a one where concentrated bursts of fun happen.</p>\n<p>This is the #defines, the <a href=\"https://changelog.com/podcast/526\">Git with your friends</a> or the one where <a href=\"https://changelog.com/shipit/30#t=01:17:22.05\">Gerhard and Jerod just laugh uncontrollably</a> for a while. These are the ones where the immersion into and the impact of the fun will be much more pronounced. These are the ones where in the past, I've wished there was a video version to switch to and watch the moment when the spontaneous fun and joy erupts.</p>\n<p>Reaching more people and an option to primarilly consume video, for those who prefer it, is also a good thing IMHO. It took a while for this...mindset to develop, but I am very exited about this change. Not because I'll gobble up every episode as a video, but because when I'll feel like I want to, I'll be able to. And I do believe that this will not hurt the audio versions, because I consider a focus on quality of both content and the form a core Changelog value <span aria-label=\"green heart\" class=\"emoji emoji-1f49a\" role=\"img\" title=\"green heart\">:green_heart:</span> <br>\n<em>(And we can always start complaining here early, if things do begin to go sideways <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span>)</em></p>",
        "id": 494466207,
        "sender_full_name": "Maroš Kučera",
        "timestamp": 1737162948
    },
    {
        "content": "<p>I think the pushback comes from experience with other podcasts where the audio only experience suffered with a similar shift and that many of us listen to podcasts during times we wouldn’t be able to watch videos. And “video first” sounds like “audio only is less important” even if that’s not the intent.</p>",
        "id": 494470579,
        "sender_full_name": "Rebecca Palma",
        "timestamp": 1737166465
    },
    {
        "content": "<p>I think we can probably take <span class=\"user-mention\" data-user-id=\"750017\">@Adam Stacoviak</span> and <span class=\"user-mention\" data-user-id=\"750170\">@Jerod Santo</span> at their word about audio not taking the back seat - they've still got a good thing going and video isn't meant to replace audio here, rather to supplement and provide some more reach. Unlikely to be much in the way of awkward visual-focused silences outside of super specific bits (read: pipedream unveiling). Feels like general win-win to me, and I'm looking forward to the odd hop over to video to see what's happening</p>",
        "id": 494489470,
        "sender_full_name": "Owen Valentine",
        "timestamp": 1737184089
    },
    {
        "content": "<p>Ok seriously...this is WAY FUNNIER watching the video version of this podcast <a href=\"https://www.youtube.com/shorts/JsVjPrTB8jU\">https://www.youtube.com/shorts/JsVjPrTB8jU</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"JsVjPrTB8jU\" href=\"https://www.youtube.com/shorts/JsVjPrTB8jU\"><img src=\"https://uploads.zulipusercontent.net/fd6e8983c090ffda638a4438ea958add51aefbc6/68747470733a2f2f692e7974696d672e636f6d2f76692f4a73566a50725442386a552f64656661756c742e6a7067\"></a></div>",
        "id": 494495229,
        "sender_full_name": "Adam Stacoviak",
        "timestamp": 1737188832
    },
    {
        "content": "<p>We'll give you your cake and let you eat it too. Video FTW. Audio for life.</p>",
        "id": 494495274,
        "sender_full_name": "Adam Stacoviak",
        "timestamp": 1737188862
    },
    {
        "content": "<p>I do believe there is a desire to not let audio take a back seat. My worry, it that we might not be conscious of the impact having video has. For example, when you listen to audio only podcasts that has video between hosts and guests, you can often feel something missing when we miss the non-verbal communication.</p>\n<p>Often hosts are describing it so things come across better in audio only format. It is easy to forget.</p>\n<p>However, most of the time, I don't find it an issue. Sometimes, if I am really curious about a section, I have been gone back and looked at the video version.</p>\n<p>I hope all this leads to a growing Changelog community.</p>",
        "id": 494540341,
        "sender_full_name": "45h15h",
        "timestamp": 1737223205
    },
    {
        "content": "<p>It looks like the video version is going to take a lot more work to edit with the clips and such. Good luck.</p>\n<p>I also listen to a chess podcast and have trouble following the conversation when they start talking in chess notation.  On video you can see the pieces as they mention the move but in the car I have no idea what the board looks like when they say knight to f3 or whatever.</p>",
        "id": 494553152,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1737233362
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"755493\">45h15h</span> <a href=\"#narrow/stream/453512-general/topic/Video.20podcasts/near/494540341\">said</a>:</p>\n<blockquote>\n<p>For example, when you listen to audio only podcasts that has video between hosts and guests, you can often feel something missing when we miss the non-verbal communication.</p>\n</blockquote>\n<p>That's exactly how Changelog records today. There's video between participants and only the audio feed is edited and released. Sure there's sometimes where Jerod reminds someone to describe what they are talking about for the listener but otherwise the audio production is great.</p>\n<p>Now imagine _also_ having access to the video version if you wish.</p>",
        "id": 494641508,
        "sender_full_name": "Matthew Sanabria",
        "timestamp": 1737293078
    },
    {
        "content": "<p>Yep agreed. With two toddlers and a full time job I have very little time to watch video, but I'm not worried about this.</p>\n<p>The truth is that most if not all interviews that have been done in the past have been done over video, simply because it's much more natural for people to talk to each other when they can see other. Nevertheless, they are able to have a conversation that people listening to the audio only can follow. I'm sure they can continue doing this, and then provide the video as an extra bonus for those who want to check it out.</p>",
        "id": 494665625,
        "sender_full_name": "Nabeel S",
        "timestamp": 1737311436
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"750017\">Adam Stacoviak</span> <a href=\"#narrow/channel/453512-general/topic/Video.20podcasts/near/494495229\">said</a>:</p>\n<blockquote>\n<p>Ok seriously...this is WAY FUNNIER watching the video version of this podcast <a href=\"https://www.youtube.com/shorts/JsVjPrTB8jU\">https://www.youtube.com/shorts/JsVjPrTB8jU</a></p>\n</blockquote>\n<p>I thought the <a href=\"https://changelog.am\">https://changelog.am</a> was a typo, but that's just the shortlink to Changeling &amp; Friends! TIL <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 494688616,
        "sender_full_name": "Kris Brandow",
        "timestamp": 1737327226
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"755905\">Tim Uckun</span> <a href=\"#narrow/channel/453512-general/topic/Video.20podcasts/near/494553152\">said</a>:</p>\n<blockquote>\n<p>It looks like the video version is going to take a lot more work to edit with the clips and such. Good luck.</p>\n</blockquote>\n<p>Even with clips, the video version will take less effort than the audio version (at least that's been my experience). Making the video version high quality takes around half the time of making the audio version sound good. That said, workflow optimizations can help reduce time for both of those.</p>",
        "id": 494688846,
        "sender_full_name": "Kris Brandow",
        "timestamp": 1737327367
    },
    {
        "content": "<p>Does it stand for “Changelog and Matt” <span aria-label=\"rolling on the floor laughing\" class=\"emoji emoji-1f923\" role=\"img\" title=\"rolling on the floor laughing\">:rolling_on_the_floor_laughing:</span></p>",
        "id": 494744729,
        "sender_full_name": "Dustin",
        "timestamp": 1737361157
    },
    {
        "content": "<p>We thought about <code>changelog.af</code> (<strong>A</strong>nd <strong>F</strong>riends) but ended up settling on <code>changelog.am</code> because it's like our \"talk radio\" flavor of the pod. This <em>probably</em> makes the <code>.fm</code> make <em>less</em> sense as a result, but what are you gonna do...</p>",
        "id": 494825334,
        "sender_full_name": "Jerod Santo",
        "timestamp": 1737383521
    },
    {
        "content": "<p>For the vast majority of conversations, audio works best. The mental bandwidth required to consume it is less, and therefore we have more of it available for something else, including imagining it. This is what many of you love about the Changelog, and I cannot imagine it ever changing. It's the main thing and, as I've learned over the years, <span class=\"user-mention\" data-user-id=\"750017\">@Adam Stacoviak</span> &amp; <span class=\"user-mention\" data-user-id=\"750170\">@Jerod Santo</span> are all about \"keeping the main thing the main thing\".</p>\n<p>80% of all human communication is non-verbal. All of this is lost in an audio podcast. That's OK and sometimes even preferable from the \"lower mental bandwidth\" perspective. But when people want to relive an experience, or be part of it to a fuller extent, video is priceless. The more technical the discussion becomes, the more important it becomes to show, not just tell.</p>\n<p>Even for the best storytellers, video offers depth that cannot be captured any other way. Here are my favourite examples to drive this point home:</p>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=tc4ROCJYbm0\">https://www.youtube.com/watch?v=tc4ROCJYbm0</a><div class=\"youtube-video message_inline_image\"><a data-id=\"tc4ROCJYbm0\" href=\"https://www.youtube.com/watch?v=tc4ROCJYbm0\"><img src=\"https://uploads.zulipusercontent.net/6c092c2a625f74812b2997963b9e3f108ce097c8/68747470733a2f2f692e7974696d672e636f6d2f76692f746334524f434a59626d302f64656661756c742e6a7067\"></a></div></li>\n<li><a href=\"https://www.youtube.com/watch?v=BXmOlCy0oBM\">https://www.youtube.com/watch?v=BXmOlCy0oBM</a><div class=\"youtube-video message_inline_image\"><a data-id=\"BXmOlCy0oBM\" href=\"https://www.youtube.com/watch?v=BXmOlCy0oBM\"><img src=\"https://uploads.zulipusercontent.net/0cfc2220a1b01668fddf96ad546eff5509c2bfd5/68747470733a2f2f692e7974696d672e636f6d2f76692f42586d4f6c4379306f424d2f64656661756c742e6a7067\"></a></div></li>\n<li><a href=\"https://www.youtube.com/watch?v=tDacjrSCeq4\">https://www.youtube.com/watch?v=tDacjrSCeq4</a><div class=\"youtube-video message_inline_image\"><a data-id=\"tDacjrSCeq4\" href=\"https://www.youtube.com/watch?v=tDacjrSCeq4\"><img src=\"https://uploads.zulipusercontent.net/2ad7237889a5e5f5d395f80036d51f2f6e21dfcd/68747470733a2f2f692e7974696d672e636f6d2f76692f744461636a7253436571342f64656661756c742e6a7067\"></a></div></li>\n</ul>\n<p>10 years from now, maybe one or more of these Changelog video podcasts might just become the favourite of someone else. And for that reason alone, I am so excited for this change.</p>\n<p>Also, 20 years from now, I cannot wait to re-watch the video Kaizen episodes that we'll record and relieve all the fun that we are yet to have. Kaizen!</p>",
        "id": 497182691,
        "sender_full_name": "Gerhard",
        "timestamp": 1738431161
    }
]