[
    {
        "content": "<p>Preston Thorpe joins us from inside prison, where he awaits a hopeful release within the next 12 months. His journey has been anything but easy—marked by hardship and uncertainty. But over the past few years, Preston has undergone a profound transformation. He’s refactored not just his skills, but his identity. Today, he proudly calls himself a software engineer and an open source contributor. In this episode, Preston shares his story of redemption, resilience, and what comes next. <span aria-label=\"link\" class=\"emoji emoji-1f517\" role=\"img\" title=\"link\">:link:</span> <a href=\"https://changelog.fm/642\">https://changelog.fm/642</a></p>\n<table>\n<thead>\n<tr>\n<th>Ch</th>\n<th>Start</th>\n<th>Title</th>\n<th>Runs</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>01</td>\n<td><a href=\"https://changelog.fm/642#t=0\">00:00</a></td>\n<td>This week on The Changelog</td>\n<td>01:07</td>\n</tr>\n<tr>\n<td>02</td>\n<td><a href=\"https://changelog.fm/642#t=67\">01:07</a></td>\n<td><a href=\"https://retool.com/changelog\">Sponsor: Retool</a></td>\n<td>02:45</td>\n</tr>\n<tr>\n<td>03</td>\n<td><a href=\"https://changelog.fm/642#t=237\">03:57</a></td>\n<td>Start the show!</td>\n<td>03:07</td>\n</tr>\n<tr>\n<td>04</td>\n<td><a href=\"https://changelog.fm/642#t=424\">07:04</a></td>\n<td>How did you end up here?</td>\n<td>03:24</td>\n</tr>\n<tr>\n<td>05</td>\n<td><a href=\"https://changelog.fm/642#t=628\">10:28</a></td>\n<td>Access and distrobution</td>\n<td>03:35</td>\n</tr>\n<tr>\n<td>06</td>\n<td><a href=\"https://changelog.fm/642#t=842\">14:02</a></td>\n<td>Dr*g flow</td>\n<td>06:12</td>\n</tr>\n<tr>\n<td>07</td>\n<td><a href=\"https://changelog.fm/642#t=1214\">20:14</a></td>\n<td>Multiple offenses</td>\n<td>15:39</td>\n</tr>\n<tr>\n<td>08</td>\n<td><a href=\"https://changelog.fm/642#t=2153\">35:53</a></td>\n<td><a href=\"https://depot.dev\">Sponsor: Depot</a></td>\n<td>02:20</td>\n</tr>\n<tr>\n<td>09</td>\n<td><a href=\"https://changelog.fm/642#t=2294\">38:14</a></td>\n<td>First steps to writing software</td>\n<td>05:19</td>\n</tr>\n<tr>\n<td>10</td>\n<td><a href=\"https://changelog.fm/642#t=2613\">43:33</a></td>\n<td>Your choice is your superpower</td>\n<td>02:16</td>\n</tr>\n<tr>\n<td>11</td>\n<td><a href=\"https://changelog.fm/642#t=2749\">45:49</a></td>\n<td>The best life hack?</td>\n<td>01:56</td>\n</tr>\n<tr>\n<td>12</td>\n<td><a href=\"https://changelog.fm/642#t=2865\">47:45</a></td>\n<td>You've made a choice. They can make a choice.</td>\n<td>03:32</td>\n</tr>\n<tr>\n<td>13</td>\n<td><a href=\"https://changelog.fm/642#t=3077\">51:17</a></td>\n<td>Getting into open source</td>\n<td>08:48</td>\n</tr>\n<tr>\n<td>14</td>\n<td><a href=\"https://changelog.fm/642#t=3605\">1:00:05</a></td>\n<td>Contributing to <code>exa</code></td>\n<td>04:28</td>\n</tr>\n<tr>\n<td>15</td>\n<td><a href=\"https://changelog.fm/642#t=3873\">1:04:33</a></td>\n<td><a href=\"https://agntcy.org\">Sponsor: Outshift by Cisco</a></td>\n<td>01:03</td>\n</tr>\n<tr>\n<td>16</td>\n<td><a href=\"https://changelog.fm/642#t=3937\">1:05:37</a></td>\n<td>Applying new skills</td>\n<td>08:26</td>\n</tr>\n<tr>\n<td>17</td>\n<td><a href=\"https://changelog.fm/642#t=4442\">1:14:02</a></td>\n<td>You seem to be on the tip</td>\n<td>03:02</td>\n</tr>\n<tr>\n<td>18</td>\n<td><a href=\"https://changelog.fm/642#t=4624\">1:17:04</a></td>\n<td>Plans for next?</td>\n<td>01:15</td>\n</tr>\n<tr>\n<td>19</td>\n<td><a href=\"https://changelog.fm/642#t=4699\">1:18:19</a></td>\n<td>Scared of what's next?</td>\n<td>01:35</td>\n</tr>\n<tr>\n<td>20</td>\n<td><a href=\"https://changelog.fm/642#t=4795\">1:19:55</a></td>\n<td>Thanks to Prime and others</td>\n<td>03:08</td>\n</tr>\n<tr>\n<td>21</td>\n<td><a href=\"https://changelog.fm/642#t=4982\">1:23:02</a></td>\n<td>The humans in our loop</td>\n<td>02:15</td>\n</tr>\n<tr>\n<td>22</td>\n<td><a href=\"https://changelog.fm/642#t=5117\">1:25:17</a></td>\n<td>Thoughts on prison reform</td>\n<td>04:32</td>\n</tr>\n<tr>\n<td>23</td>\n<td><a href=\"https://changelog.fm/642#t=5389\">1:29:49</a></td>\n<td><a href=\"https://www.prisonexp.org\">The Stanford Prison Experiment</a></td>\n<td>09:21</td>\n</tr>\n<tr>\n<td>24</td>\n<td><a href=\"https://changelog.fm/642#t=5951\">1:39:11</a></td>\n<td>Wrapping up</td>\n<td>01:24</td>\n</tr>\n<tr>\n<td>25</td>\n<td><a href=\"https://changelog.fm/642#t=6035\">1:40:35</a></td>\n<td>Closing thoughts and stuff</td>\n<td>01:38</td>\n</tr>\n</tbody>\n</table>",
        "id": 520125985,
        "sender_full_name": "Logbot",
        "timestamp": 1748032627
    },
    {
        "content": "<p>just finished listening to this episode. my heart really goes out to preston for the rough experiences he went through, but what an inspirational story of his “refactoring”.</p>\n<p>really loved how preston shed light on all the individuals incarcerated that genuinely want to better themselves.</p>\n<p>it’s great that you all are using your platform to shine light on this aspect of american society.</p>",
        "id": 520134749,
        "sender_full_name": "valon-loshaj",
        "timestamp": 1748037547
    },
    {
        "content": "<p>Fun episode. Really shows the power of dedicated focus time. Obviously the focus time was almost forced in this case but they still made the choice to use their time to study. I wish more people would understand the value of focus time and use it to learn new skills rather than wasting time on social media or something. Hope he keeps up the habits when he's out of prison.</p>",
        "id": 520446653,
        "sender_full_name": "Matthew Sanabria",
        "timestamp": 1748264403
    },
    {
        "content": "<p>I really liked hearing Preston’s perspective. I didn’t know there were that many opportunities now for rehabilitation (at least in a state like Maine).</p>\n<p>I was curious about how compensation works for remote work in prison. I’ve heard stories of underpayment that would be called “criminal” for manual labor in some states. Or that it can only go to top off a canteen fund. Or that proceeds from IP are limited or impounded (to discourage profiting from crimes). He seemed fairly positive on how Maine’s system works, so I’m choosing to believe that he’s making a decent salary that’s going into an account he’ll access to on release, but I’d line to know for sure.</p>",
        "id": 520994898,
        "sender_full_name": "Andrew O'Brien",
        "timestamp": 1748477721
    },
    {
        "content": "<p>I'm sure it was an Ars Technica book review, but I can't seem to find it now ...</p>\n<p>anyway, they were reviewing a book that suggested that we treat criminality like a disease: if someone is dangerous to others then we treat it like an infectious disease and isolate them</p>\n<p>but otherwise, the claim was that by the time we're in our 20s, our genetics and upbringing have cemented in our impulsive reactions for any given situation, so it's not that we're not responsible for our crimes, but that it takes tremendous effort to react more slowly and thoughtfully if we haven't already learned how to do so</p>\n<p>and viewed through this lens, most of what we call \"justice\" is pointlessly cruel</p>",
        "id": 520996069,
        "sender_full_name": "Ron Waldon-Howe",
        "timestamp": 1748478448
    },
    {
        "content": "<p>I will say candidly, the Stanford Prison Experiment part really clanged for me. It's a long read, but I highly recommend <a href=\"https://archive.is/eLO52\">Ben Blum's 2018 article</a>. He talked to many of the people involved including Dr. Zimbardo (the professor). The narrative of the SPE has superseded its scientific value and its popularity hides some deep methodological and troubling ethical flaws and outright fabrications on Zimbardo's part.</p>\n<p>Not only that, but the SPE helped turn a generation of academic criminologists away from prison reform because it seemed to demonstrate that prison was inherently cruel, dehumanizing, and therefore unreformable. The kinds of opportunities that people like Preston have now for rehabilitation would have been dismissed as wasted.</p>\n<p>If I'm understanding Adam's point, it was that the abuse that prisoners face is traumatizing and it takes a lot maintain one's sense of value in such an environment. That's valid, but I don't think we need the SPE to arrive at that. My read on how Preston responded to that line of questions gave me the sense that he was aware of at least some of its baggage.</p>",
        "id": 521000942,
        "sender_full_name": "Andrew O'Brien",
        "timestamp": 1748481635
    },
    {
        "content": "<p>I honestly don't know what should be done but it's obvious that prisons don't work. They don't discourage crime, they don't reform people and if anything they harden people and make them more prone to commit more crimes. They also make people unable to cope with life outside of prison.</p>",
        "id": 521179584,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1748556925
    },
    {
        "content": "<p>I have been thinking about this for the last couple of days and a thought occured to me.</p>\n<p>A child is born in your town in a hospital not too far away from you, maybe the same hospital you were born in. Is raised in your culture and traditions, goes to public school just like you did. Watched the same TV shows as you, listened to same songs we all do, and participated in the same culture as we all do.</p>\n<p>One day this person is arrested for whatever reason.</p>\n<p>Society doesn't look at this person and say \"how have we failed this person, what did fail to provide him or her that they had to resort to crime or drugs. What kinds of messages did our culture and education system feed them which resulted in this etc\". Instead society says \"this person failed us, they chose to harm our society. This is an affront to our society and they  must be punished harshly as possible.\"</p>\n<p>I think this is at the core of what's wrong with our so called justice system.  </p>\n<p>Note: It's obvious the justice system in the USA is collapsing rapidly but this notion applies to most other countries as well.</p>",
        "id": 521379724,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1748643778
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"752964\">@Andrew O'Brien</span> thank you for this. I came here specifically to see if anyone chimed in about the more recent controversies of the SPE. I remember learning about it back in high school pych and my mind was blown. It sucks to hear about all the negatives n stuff but it's important for people to know.</p>",
        "id": 521397400,
        "sender_full_name": "mray",
        "timestamp": 1748657729
    },
    {
        "content": "<p>I don't know why people don't conduct similar studies. SPE was clearly deeply flawed.</p>",
        "id": 521408399,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1748666971
    },
    {
        "content": "<p>You can't fix what you can't measure, so there's probably intentional difficulty and lack of funding into such things</p>",
        "id": 521528672,
        "sender_full_name": "Ron Waldon-Howe",
        "timestamp": 1748767616
    },
    {
        "content": "<p>i think there are some special interests that want to make sure those measurements never see the light of day unfortunately</p>",
        "id": 521565640,
        "sender_full_name": "valon-loshaj",
        "timestamp": 1748791124
    },
    {
        "content": "<p>I live in NZ and the crime rate here is pretty low compared to the US and probably a lot of other European countries. It's much higher than places like Singapore, China, Japan and many other asian countries though.</p>\n<p>Although I believe there is a certain genetic component to crime I don't think it genes play as much of a role in crime and recidivism as social norms, education systems, culture, and of course the justice system in a country.  I think there are plenty of studies done all over the world on how to reduce crime because crime is expensive for a society and impacts elections.  I guess I need to educate myself on what they say.</p>\n<p>I should say that despite crime being relatively low in NZ it was a huge factor in the last election.  The media especially the print media  really hyped up any incidence of crime in the run up to the election. Once the election was over they shut up about it.    I guess people are not driven by studies and science and facts and silly things like that. It's all about emotion as I said in my previous post.</p>\n<p>We as a society lash out on criminals because we don't want to admit to ourselves that we built and run a society where a child (more often than not a young person) grows up and decides the best thing he (more often he than she for sure) can do today is to steal something or commit come act of violence.  </p>\n<p>Finally we fixate on the low level crime like theft or assault or whatever while giving white collar crime a pass. Nobody seems that upset when a company folds after the management fleeces the customers and the vendors but if a teenager beaks a store front window takes an item it makes the front page.</p>",
        "id": 521606607,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1748815514
    },
    {
        "content": "<p>Are \"possession of drugs\" crimes as unevenly enforced (per racism) in NZ as they are in e.g. USA?</p>",
        "id": 521608855,
        "sender_full_name": "Ron Waldon-Howe",
        "timestamp": 1748817055
    },
    {
        "content": "<p>Yes it is. Not just drug possession either. The unfortunate fact is that some neighbourhoods are just more heavily policed than others.  I had the same experience when I was growing up in the USA.  By the luck of geography my house was on one side of the railroad tracks (literally) and a couple of hundred feet away was the boundary for the district. People on my side of the boundary went to a mostly white school while the people on the other side went to a mostly black school. People in my area were mostly black and Puerto Ricans but the a few blocks away in one direction it was mostly white and in the other direction were mostly black.</p>\n<p>Because I hung out in the lightly policed areas I was able to get away with drinking underage, trespassing,  minor acts  vandalism, doing recreational substances etc. My friends from the other district often got caught doing the exact same things because the police were around.  Despite this I still got caught a couple of times but I was let go because I was white passing and the cops couldn't be bothered to book me for driving on the golf course or smoking a joint in the park.  When my friends got caught I think the police decided they needed to be scared straight or something they got charged or at least got hauled off the station and finger printed before being let go. </p>\n<p>It's all so unfair and truly the only reason I didn't end up with a criminal record like my friends did was luck and skin color. </p>\n<p>It sucks.</p>",
        "id": 521641878,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1748838049
    },
    {
        "content": "<p>Oh I should point out that in NZ it's the indigenous Māori population that gets the wrong end of the stick in crime statistics,  health outcomes and of course  poverty statistics.</p>",
        "id": 521642246,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1748838283
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"755905\">Tim Uckun</span> <a href=\"#narrow/stream/456187-interviews/topic/642.3A.20Refactored.20in.20prison/near/521408399\">said</a>:</p>\n<blockquote>\n<p>I don't know why people don't conduct similar studies. SPE was clearly deeply flawed.</p>\n</blockquote>\n<p>The article I linked talks about a couple of failed attempts to reproduce it. One (either in Australia or UK, can’t recall) resulted in the prisoners banding together to negotiate better treatment in exchange for making the guards’ tasks (like headcount) easier. The guards became almost passive when everything was going well.</p>\n<p>The key differences were that the guards weren’t coached to be aggressive and it was made clear that prisoners could leave the experiment.</p>",
        "id": 521768729,
        "sender_full_name": "Andrew O'Brien",
        "timestamp": 1748876226
    },
    {
        "content": "<p>I guess the experiment has to be done in a real prison which is ethically dubious.</p>",
        "id": 521853479,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1748902231
    }
]