[
    {
        "content": "<p>I am sure this is a fine line but at what point does an interview become an ad?</p>\n<p>I am not talking about open source maintainers or anything like that but when you interview the CEO or CTO of a company and that interview centers around their product or service it starts to smell like product placement or just plain old advertising to me.</p>\n<p>Not that these people don't have anything interesting to say but I think you guys should do your best to steer the conversation away from the product. Maybe talk about their personal history or whatever I don't know. </p>\n<p>Anyway I ended the recent Beyang Liu episode prematurely because of this even though I am a user of cody and like it.  </p>\n<p>Maybe it's just me.</p>",
        "id": 505995375,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1742158364
    },
    {
        "content": "<p>Our interviews are never ads. In other words, you cannot pay us money to come on our shows. We only talk to/about things we are genuinely curious about.</p>",
        "id": 506003512,
        "sender_full_name": "Jerod Santo",
        "timestamp": 1742164436
    },
    {
        "content": "<p>I wasn't saying you got paid for the interview. I am just saying if the interview is almost exclusively about the product it starts sounding like an ad.</p>",
        "id": 506037778,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1742185615
    },
    {
        "content": "<p>I think the interesting thing to talk to Beyang Liu about is what they're doing at Sourcegraph and why. Not what shoes he's collecting or why he chooses to Uber vs buy a car. Ok those things would be cool topics too, but the point of the call for me was to explore the world of Sourcegraph and how we can reach these economies of scale as an industry.</p>",
        "id": 506038384,
        "sender_full_name": "Adam Stacoviak",
        "timestamp": 1742185992
    },
    {
        "content": "<p>We have a history with Beyang that goes back to 2016.</p>",
        "id": 506038566,
        "sender_full_name": "Adam Stacoviak",
        "timestamp": 1742186109
    },
    {
        "content": "<p>I'm glad you shared this point for you though, so keep doing it.</p>",
        "id": 506038722,
        "sender_full_name": "Adam Stacoviak",
        "timestamp": 1742186215
    },
    {
        "content": "<p>It would have been an ad IF I was trying to have him convince me/you how to get started. I didn't even ask him how to get started or even insinuate that you should. Podcasts are still the MOST AUTHENTIC form of content out there. We MUST explore the platforms out there and WHY they exist. This episode was an example of just that. It was an honest conversation with no agenda.</p>",
        "id": 506040735,
        "sender_full_name": "Adam Stacoviak",
        "timestamp": 1742187379
    },
    {
        "content": "<p>Different folks have different priorities and values and tastes, so it's probably very normal for someone to not like 100% of points in 100% of episodes</p>",
        "id": 506050141,
        "sender_full_name": "Ron Waldon-Howe",
        "timestamp": 1742192059
    },
    {
        "content": "<p>You know an ad interview when you see one. And the Stackoverflow Podcast has a lot of that. But this podcast isn't one. </p>\n<p>The Changelog Podcast priorities are different. I believe Jerod and Adam genuinely want to share what's best for developers with the spirit of open source.</p>\n<p>Changelog podcast is highly underrated. It is the best tech podcast; \"on Joe Rogan's level\". Even their weekly news brief is golden. Not everything here is for everybody but there's something here for everyone.</p>",
        "id": 506050153,
        "sender_full_name": "John Johnson",
        "timestamp": 1742192065
    },
    {
        "content": "<p>+1 - some episodes serve as really effective personal bias/preference highlighters</p>\n<p>(honestly, sometimes it takes some alone time with coffee to figure out why an episode lost me or never clicked - and so far it's always been a \"me problem\" <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> )</p>",
        "id": 506175615,
        "sender_full_name": "AJ Kerrigan",
        "timestamp": 1742223206
    },
    {
        "content": "<p>Sometimes it's just the wrong content at the wrong time, maybe if I've been drowning in k8s material that morning, I don't enjoy a podcast about k8s :)</p>",
        "id": 506266636,
        "sender_full_name": "Ron Waldon-Howe",
        "timestamp": 1742247763
    },
    {
        "content": "<p>Yeah I've skipped a few like this, but not feeling like they're ads. Just a specific enough topic that's outside of my interest is all - can't all be perfect for my needs. :P</p>",
        "id": 507535188,
        "sender_full_name": "Owen Valentine",
        "timestamp": 1742711484
    },
    {
        "content": "<p>Yesterday I was walking my dog and listening to the podcast. It was the episode with Ilya. It occurred to me that the ads in the podcast are also structured as interviews. Like the one from retool for example.  Just a realization.</p>",
        "id": 507607832,
        "sender_full_name": "Tim Uckun",
        "timestamp": 1742765378
    },
    {
        "content": "<p>I was a plus plus subscriber while I could afford it, but these days I find Change Log adverts to be more interesting than elsewhere <br>\nIt's still a sales pitch, but there's enough technical details and story to be compelling</p>",
        "id": 507609813,
        "sender_full_name": "Ron Waldon-Howe",
        "timestamp": 1742766920
    },
    {
        "content": "<p>They _feel_ like ads to me when only 1 product is spoken about. I get that a CxO would see the world through their product's lens, but it feels nice when they also pay respects to others solving the same problems</p>",
        "id": 507631599,
        "sender_full_name": "Sukhdeep Brar",
        "timestamp": 1742782161
    },
    {
        "content": "<p>That would be an amazing level of honesty in an advert:</p>\n<blockquote>\n<p>other options in this space include X, which is a good choice in these cases, but in these other cases you'll find more value in our solution</p>\n</blockquote>",
        "id": 507643078,
        "sender_full_name": "Ron Waldon-Howe",
        "timestamp": 1742789092
    },
    {
        "content": "<p>It's been said before, but products (especially open-source) with a \"why <em>not</em> X?\" section on their website get my respect. Aside from anything else it is just respectful of <em>my</em> time when evaluating X.</p>",
        "id": 507659330,
        "sender_full_name": "Daniel Buckmaster",
        "timestamp": 1742796810
    },
    {
        "content": "<p>I think that was mentioned on the documentation episode, something about one of the categories/tasks being appraisal? Or something?<br>\nVery helpful, indeed</p>",
        "id": 507687777,
        "sender_full_name": "Ron Waldon-Howe",
        "timestamp": 1742806237
    },
    {
        "content": "<p>In the Render episode, the conversation was pretty upfront about comparing Render to other products and how they each have their niches. Still a little \"ad-like\" because Render \"won\" it's niche, but still appreciated <span aria-label=\"smiling face\" class=\"emoji emoji-263a\" role=\"img\" title=\"smiling face\">:smiling_face:</span></p>",
        "id": 507714239,
        "sender_full_name": "Sukhdeep Brar",
        "timestamp": 1742812312
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"771585\">Ron Waldon-Howe</span> <a href=\"#narrow/channel/456187-interviews/topic/Interview.20or.20an.20ad.3F/near/507609813\">said</a>:</p>\n<blockquote>\n<p>I was a plus plus subscriber while I could afford it, but these days I find Change Log adverts to be more interesting than elsewhere <br>\nIt's still a sales pitch, but there's enough technical details and story to be compelling</p>\n</blockquote>\n<p>Yeah that is one thing I like about Changelog ads, they are conversational and actually go into detail of the problem that they are trying to solve. It refreshingly different from other podcasts</p>",
        "id": 508108247,
        "sender_full_name": "Don MacKinnon",
        "timestamp": 1742930171
    },
    {
        "content": "<p>Changelog interviews don't usually strike me as product placements unless it's with a devrel.  The slight upside of a down tech labor market is it seems to have put the zap on the devrel ZIRP</p>",
        "id": 510419728,
        "sender_full_name": "Rory O'Connor",
        "timestamp": 1743893143
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"756263\">Don MacKinnon</span> <a href=\"#narrow/stream/456187-interviews/topic/Interview.20or.20an.20ad.3F/near/508108247\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"771585\">Ron Waldon-Howe</span> <a href=\"#narrow/channel/456187-interviews/topic/Interview.20or.20an.20ad.3F/near/507609813\">said</a>:</p>\n<blockquote>\n<p>I was a plus plus subscriber while I could afford it, but these days I find Change Log adverts to be more interesting than elsewhere <br>\nIt's still a sales pitch, but there's enough technical details and story to be compelling</p>\n</blockquote>\n<p>Yeah that is one thing I like about Changelog ads, they are conversational and actually go into detail of the problem that they are trying to solve. It refreshingly different from other podcasts</p>\n</blockquote>\n<p>Honestly, as a subscriber I wouldn’t mind getting the ad packs at the end. Wouldn’t necessarily listen to all, especially repeats, but I have found out about a few things worth trying through them. And doing an ad buy shows some bit of legitimacy in a business.</p>\n<p>Maybe a preference on custom feeds? Sorry to make more work for you, Jerod.</p>",
        "id": 510982249,
        "sender_full_name": "Andrew O'Brien",
        "timestamp": 1744130929
    },
    {
        "content": "<p>This is something I'm up for (see <a class=\"stream-topic\" data-stream-id=\"455097\" href=\"/#narrow/channel/455097-kaizen/topic/A.20Sponsors.20feed/with/469763999\">#kaizen &gt; A Sponsors feed</a> ) but on an ongoing basis it's actually more work for Adam. I'm not signing him up for that unless he's up for it. <span aria-label=\"sunglasses\" class=\"emoji emoji-1f60e\" role=\"img\" title=\"sunglasses\">:sunglasses:</span></p>",
        "id": 510983967,
        "sender_full_name": "Jerod Santo",
        "timestamp": 1744131486
    },
    {
        "content": "<p>Regarding actual ads, I think we all super appreciate how clear you indicate them - with the music and with the chapter name. That’s awesome.</p>",
        "id": 511530304,
        "sender_full_name": "Jimmy Sweeney",
        "timestamp": 1744329683
    },
    {
        "content": "<p>I listen to a lot of podcasts with authors as guests and, generally speaking, their goal for coming on the podcast is so that listeners buy their book. Yet those never feel like ads to me. If we draw a straight analogy to CEOs talking about their product, I mean clearly their goal (maybe not their only goal) is to get more users. But I agree with <span class=\"user-mention\" data-user-id=\"755905\">@Tim Uckun</span> that there is a risk in those interviews to feel more like ads. So I think Adam has tough balance to strike. </p>\n<p>At the same time though, since they literally aren’t paid advertisements, there’s nothing shady or misleading going on here. It just might be, as others have pointed out, that interviews about products might not be everyone’s cup of tea.</p>",
        "id": 511534016,
        "sender_full_name": "Jimmy Sweeney",
        "timestamp": 1744331730
    },
    {
        "content": "<p>Food for thought: <a href=\"https://simone.org/advertising/\">https://simone.org/advertising/</a></p>",
        "id": 511549868,
        "sender_full_name": "Ron Waldon-Howe",
        "timestamp": 1744340479
    },
    {
        "content": "<p>We've only had paid advertising for a century or so, so humans lived without it, and maybe we _could_ live without it again</p>",
        "id": 511550332,
        "sender_full_name": "Ron Waldon-Howe",
        "timestamp": 1744340774
    },
    {
        "content": "<p>If the ads, interviews, or whatever name we give it next keep Changelog going I'm all for it. I listen to an ad at least once and then if I never want to hear it again I just seek past it on the fly. There are people whose voice annoys me (sorry David at Retool) and companies I just have no interest in hearing about (sorry Notion) so I just skip those ads.</p>\n<p>To me the format is fine. It's clearly delimited and doesn't feel so much like a shill for a product but rather just an overview of what the thing is and what it can do for you. Although there was that one (Sentry?) ad that just droned on and on to the point I was like okay we can stop now.</p>",
        "id": 511727179,
        "sender_full_name": "Matthew Sanabria",
        "timestamp": 1744402610
    },
    {
        "content": "<p>I guess what I'm really trying to say is I don't pay for ++ so I accept the ads as my form of here monetize me.</p>",
        "id": 511727268,
        "sender_full_name": "Matthew Sanabria",
        "timestamp": 1744402671
    }
]